#Завдання 1. Жив-був капелюх. У капелюсі не було кролика, натомість був список із п’яти чисел: 1, 2, 3, 4 та 5.
#напишіть рядок коду, що пропонує користувачеві замінити число всередині списку цілим числом, введеним користувачем (крок 1)
#напишіть рядок коду, який видаляє останній елемент зі списку (крок 2)
#напишіть рядок коду, який друкує довжину існуючого списку (крок 3).
hat_list = [1, 2, 3, 4, 5]
print('Ви отримали список із: \n')
print(hat_list)
print('Введіть номер, який буде замінено: ')
new_number = int(input("Введіть нове число: "))
index = 2
hat_list[index] = new_number
del hat_list[4]
print(hat_list)
print(len(hat_list))

#Завдання 2. Написати програму сортування списку у порядку зростання методом бульбашки.
def bubble_sort(lst):
    n = len(lst)
    for i in range(n):
        for j in range(0, n-i-1):
            if lst[j] > lst[j+1]:
                lst[j], lst[j+1] = lst[j+1], lst[j]
    return lst
lst = [10500, 55, 31, 44, 21, 0, 14, 991, 22232, 323232, 232323232, 3232323232323]
sorted_lst = bubble_sort(lst)
print(sorted_lst)

#Завдання 3. Уявіть список - не дуже довгий, не дуже складний, просто звичайний список, що містить деякі цілі числа.
#Деякі з цих чисел можуть повторюватись, і це ключ до розгадки. Ми не хочемо повторень. Ми хочемо, щоб їх видалили.
#Ваше завдання – написати програму, яка видаляє всі дублікати чисел зі списку.
#Ціль полягає в тому, щоб скласти список, в якому всі числа зустрічаються не більше одного разу.
numbers = [1, 2, 4, 4, 1, 4, 2, 6, 2, 9]
new_numbers = []
for num in numbers:
    if num not in new_numbers:
        new_numbers.append(num)
print(new_numbers)

#Завдання 4. Погляньте на шахівницю. Кожне поле містить кілька індексів, які необхідно вказати для доступу до вмісту клітини.
#Напишіть код, використоувуючи генератори списків, який створює матрицю 8х8 з пустими клітинками (пуста клітинка задається як “_“) для задання шахівниці і розставте чотири тури по кутках шахівниці
board = [["_"] * 8 for _ in range(8)]
board[0][0] = "R"
board[0][7] = "R"
board[7][0] = "R"
board[7][7] = "R"
for row in board:
    print(" ".join(row))