# Завдання 1.Напишіть програму, яка створює кортеж зі списку чисел, а потім виводить на екран всі числа, які менші за задане число n. Умова: користувач вводить число n,
#і щоб створити новий список result, який містить всі числа з кортежу, які менші за n, реалізувати за допомогою генератора списків.

numbers = (5, 7, 8, 10, 15, 17, 23, 35)
n = int(input("Введіть число n: "))
result = [num for num in numbers if num < n]
print("Числа, які менші за", n, ":", result)

#Завдання 2. Напишіть програму, яка створює кортеж з трьох елементів, які є рядками, та з’єднує їх в один рядок з комою як роздільником.
strings = ('Python', 'KRNU', 'LAB 7')
result = ','.join(strings)
print(result)
#Завдання 3. Створіть словник, який містить інформацію про книги в бібліотеці. Ключами будуть назви книг, а значеннями - автори, рік видання та кількість сторінок. Виведіть на екран інформацію про книгу, введену користувачем.
library = {
    'Пригоди Гекльберрі Фінна': {'автор': 'Марк Твен', 'рік видання': 1884, 'кількість сторінок': 366},
    'Майстер і Маргарита': {'автор': 'Михайло Булгаков', 'рік видання': 1967, 'кількість сторінок': 402},
    '1984': {'автор': 'Джордж Орвелл', 'рік видання': 1949, 'кількість сторінок': 328},
    'Три товариші': {'автор': 'Еріх Марія Ремарк', 'рік видання': 1936, 'кількість сторінок': 448}
}
book_title = input("Введіть назву книги: ")
if book_title in library:
    book_info = library[book_title]
    print("Інформація про книгу '{0}':".format(book_title))
    print("Автор:", book_info['автор'])
    print("Рік видання:", book_info['рік видання'])
    print("Кількість сторінок:", book_info['кількість сторінок'])
else:
    print("Книга '{0}' не знайдена в бібліотеці.".format(book_title))

#Завдання 4. Напишіть програму, яка створює словник, що містить інформацію про студентів, використовуючи вказані кортежі в якості значень. Кожен ключ – це прізвище студента. Виведіть на екран інформацію про студента, введеного користувачем.
student = {
    'Чижиков': {'курс': 'Другий', 'назва групи': 'KI-20-1', 'код спеціальності': 123},
    'Патаушкін': {'курс': 'Третій', 'назва групи': 'ФСI-13-1', 'код спеціальності': 228},
    'Цаль': {'курс': 'Перший', 'назва групи': 'КН-19-1', 'код спеціальності': 122},
}
student_surname = input("Введіть фамілію студента: ")
if student_surname in student:
    student_info = student[student_surname]
    print("Інформація прo студента '{0}':".format(student_surname))
    print("Куrс:", student_info['курс'])
    print("Назва групи:", student_info['назва групи'])
    print("Код спеціальності:", student_info['код спеціальності'])
else:
    print("Студент '{0}' не знайден у базі данних.".format(student_surname))

#Завдання 5. Створіть словник, який містить інформацію про більше, ніж один номер телефону для кожного з контактів в телефонній книзі. Ключами будуть імена контактів, а значеннями - список їхніх номерів телефонів.
# Напишіть функцію, яка дозволяє додати новий номер телефону до списку номерів телефону певного контакту. Потім виведіть на екран список номерів телефонів для всіх контактів.

phonebook = {
    'Андрій': ['555-1234', '555-5678'],
    'Микита': ['555-9876', '555-4321'],
    'Артем': ['555-1111', '555-2222', '555-3333']
}
contact_name = input("Введіть ім'я контакту: ")
phone_number = input("Введіть номер телефону: ")
def addphonenumber():
    contactname = input("Введіть ім'я контакту: ")
    phonenumbers = input("Введіть новий номер телефону: ")
    if contact_name in phonebook:
        phonebook[contactname].append(phonenumbers)
    else:
        phonebook[contact_name] = phonenumbers
addphonenumber()
for contactname, phonenumbers in phonebook.items():
    print(contactname + ': ' + ', '.join(phonenumbers))